Repository: inigoconsulting/wcc.donation
Catalog: wcc/donation/locales/*/LC_MESSAGES/wcc.donation.po
Languages: es

source: Accompaniers in Palestine and Israel(EAPPI)
es: Acompañantes en Palestina e Israel

source: Choose your currency
es: Elija la moneda

source: Church relationships and Christian witness
es: Relaciones con las iglesias y testimonio cristiano

source: Comments/special allocation
es: Comentarios / destino especia

source: Development and justice
es: Desarrollo y justicia

source: E-mail
es: Dirección electrónical

source: Ecumenical Water Network
es: Red Ecuménica del Agua

source: Ecumenical study and research - Bossey
es: Estudio e investigación ecuménicas - Bossey

source: Euro
es: Euros

source: First name
es: Nombre

source: HIV/AIDS initiative in Africa
es: Programa VIH/SIDA en África

source: I would like my gift to go to
es: Deseo que mi contribución vaya dirigida a

source: Inter-religious dialogue
es: Diálogo interreligioso

source: Last name
es: Apellido

source: Monthly gift
es: contribución mensual

source: Other
es: Otras

source: Peace and reconciliation
es: Paz y reconciliación

source: Single gift
es: contribución única

source: Sterling
es: Libras Esterlinas

source: Swiss Franc
es: Francos Suizos

source: US Dollar
es: Dólares Estadounidenses

source: WCC 10th Assembly
es: X Asamblea del CMI

source: Where it's most needed
es: Donde sea más necesaria

source: donate_now
es: DONACIONES

source: submit_button
es: Enviar
